== Sample Data Set

//setup
[source,cypher]
----
CREATE 
  (A:Station { name: 'A' }),
  (B:Station { name: 'B' }),
  (C:Station { name: 'C' }),
  (D:Station { name: 'D' }),
  (E:Station { name: 'E' }),
  (A)-[:CONNECTS_TO { distance: 5 }]->(B),
  (B)-[:CONNECTS_TO { distance: 4 }]->(C),
  (C)-[:CONNECTS_TO { distance: 8 }]->(D),
  (D)-[:CONNECTS_TO { distance: 8 }]->(C),
  (D)-[:CONNECTS_TO { distance: 6 }]->(E),
  (A)-[:CONNECTS_TO { distance: 5 }]->(D),
  (C)-[:CONNECTS_TO { distance: 2 }]->(E),
  (E)-[:CONNECTS_TO { distance: 3 }]->(B),
  (A)-[:CONNECTS_TO { distance: 7 }]->(E)

RETURN *
----

//graph

'''
==== A-B-C distance

[source,cypher]
----
MATCH p = (:Station { name: 'A' })-->(:Station { name: 'B' })-->(:Station { name: 'C' })
RETURN REDUCE(total = 0, r IN RELATIONSHIPS(p)| r.distance + total) AS distance
----

//output
//table

'''
==== A-D distance

[source,cypher]
----
MATCH p = (:Station { name: 'A' })-->(:Station { name: 'D' })
RETURN REDUCE(total = 0, r IN RELATIONSHIPS(p)| r.distance + total) AS distance
----

//output
//table

'''
==== A-D-C distance

[source,cypher]
----
MATCH p = (:Station { name: 'A' })-->(:Station { name: 'D' })-->(:Station { name: 'C' })
RETURN REDUCE(total = 0, r IN RELATIONSHIPS(p)| r.distance + total) AS distance
----

//output
//table

'''
==== A-E-B-C-D distance

[source,cypher]
----
MATCH p = (:Station { name: 'A' })-->(:Station { name: 'E' })-->(:Station { name: 'B' })-->(:Station { name: 'C' })-->(:Station { name: 'D' })
RETURN REDUCE(total = 0, r IN RELATIONSHIPS(p)| r.distance + total) AS distance
----

//output
//table
